<?php


namespace App\Http\Controllers\Api;


class ConstVariable
{
    //图片验证码map
    const TYPE = [
        1 => '管理员登录',
        2 => '用户登录',
        3 => '学生注册',
        4 => '教师注册'
    ];

    //性别map
    const GENDER = [
        0=>'不限',
        1=>'男',
        2=>'女'
    ];

    //年级map
    const GRADE = [
        -1 => '学前儿童',
        1 => '一年级',
        2 => '二年级',
        3 => '三年级',
        4 => '四年级',
        5 => '五年级',
        6 => '初中一年级',
        7 => '初中二年级',
        8 => '初中三年级',
        9 => '初中四年级',
        10 => '高中一年级',
        11 => '高中二年级',
        12 => '高中三年级',
    ];

    //教学方式
    const TEAWAY = [
        0 => '不限',
        1 => '教员上门',
        2 => '网络远程'
    ];

    //教师资格证
    const ITIC = [
        0 => '无教师资格证',
        1 => '有教师资格证',
    ];

    //外语语种
    const FLANGUAGE = [
        1=>'英语',
        2=>'俄语',
    ];

    //外语等级
    const BAND = [
        0=>'一般',
        1=>'四级',
        2=>'六级',
        3=>'专业八级',
    ];

    const PUTONGHUA = [
        1=>'较差',
        2=>'一般',
        3=>'标准',
    ];

    //学生下单状态
    const STUADDSTATE = 10;
    //教师下单状态
    const TEAADDSTATE = 20;
}